Repository: xibbon/CodeEditorUI
Catalog: Sources/CodeEditorUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bn, cs, de, es, fr, hi, hu, id, it, ja, ko, ms, nl, pl, pt_br, ru, ta, te, th, tr, vi, zh_hans

source: # Line Number: **%lld**
ar: # رقم السطر: **%lld**
bn: # লাইন নম্বর: **%lld**
cs: # Číslo řádku: **%lld**
de: # Zeilennummer: **%lld**
es: # Número de línea: **%lld**
fr: # Numéro de ligne : **%lld**
hi: # पंक्ति संख्या: **%lld**
hu: # Sor száma: **%lld**
id: # Nomor Baris: **%lld**
it: # Numero di riga: **%lld**
ja: # 行番号: **%lld**
ko: # 줄 번호: **%lld**
ms: # Nombor Baris: **%lld**
nl: # Regelnr.: **%lld**
pl: # Numer linii: **%lld**
pt_br: # Número da Linha: **%lld**
ru: # Номер строки: **%lld**
ta: # வரி எண்: **%lld**
te: # లైన్ నంబర్: **%lld**
th: # หมายเลขบรรทัด: **%lld**
tr: # Satır Numarası: **%lld**
vi: # Số dòng: **%lld**
zh_hans: # 行号：**%lld**

source: Cancel
ar: إلغاء
bn: বাতিল
cs: Zrušit
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
hu: Mégse
id: Batal
it: Annulla
ja: キャンセル
ko: 취소
ms: Batal
nl: Annuleren
pl: Anuluj
pt_br: Cancelar
ru: Отмена
ta: ரத்து செய்
te: రద్దు చేయండి
th: ยกเลิก
tr: İptal
vi: Huỷ bỏ
zh_hans: 取消

source: Close
ar: إغلاق
bn: বন্ধ করুন
cs: Zavřít
de: Schließen
es: Cerrar
fr: Fermer
hi: बंद करें
hu: Bezárás
id: Tutup
it: Chiudi
ja: 閉じる
ko: 닫기
ms: Tutup
nl: Sluiten
pl: Zamknij
pt_br: Fechar
ru: Закрыть
ta: மூடு
te: మూసివేయండి
th: ปิด
tr: Kapat
vi: Đóng
zh_hans: 关闭

source: Error
ar: خطأ
bn: সমস্যা/ভুল
cs: Chyba
de: Fehler
fr: Erreur
hi: एरर
hu: Hiba
it: Errore
ja: エラー
ko: 오류
ms: Ralat
nl: Fout
pl: Błąd
pt_br: Erro
ru: Ошибка
ta: பிழை
te: లోపం
th: ผิดพลาด
tr: Hata
vi: Lỗi
zh_hans: 错误

source: File
ar: ملف
bn: ফাইল
cs: Soubor
de: Datei
es: Archivo
fr: Fichier
hi: फ़ाइल
hu: Fájl
ja: ファイル
ko: 파일
ms: Fail
nl: Bestand
pl: Plik
pt_br: Arquivo
ru: Файл
ta: கோப்பு
te: ఫైల్
th: ไฟล์
tr: Dosya
vi: Tệp
zh_hans: 文件

source: File not found %@
ar: الملف غير موجود %@
bn: ফাইল পাওয়া যায়নি %@
cs: Soubor nenalezen %@
de: Datei nicht gefunden %@
es: Archivo no encontrado %@
fr: Fichier non trouvé %@
hi: फ़ाइल नहीं मिली %@
hu: Fájl nem található %@
id: Berkas tidak ditemukan %@
it: File non trovato %@
ja: ファイルが見つかりません %@
ko: 파일을 찾을 수 없습니다 %@
ms: Fail tidak ditemui %@
nl: Bestand niet gevonden %@
pl: Plik nie znaleziony %@
pt_br: Arquivo não encontrado %@
ru: Файл не найден %@
ta: கோப்பு காணப்படவில்லை %@
te: ఫైల్ కనపడలేదు %@
th: ไม่พบไฟล์ %@
tr: Dosya bulunamadı %@
vi: Không tìm thấy tệp %@
zh_hans: 文件未找到 %@

source: Ignore
ar: تجاهل
bn: উপেক্ষা করুন
cs: Ignorovat
de: Ignorieren
es: Ignorar
fr: Ignorer
hi: अनदेखा करें
hu: Figyelmen kívül hagy
id: Abaikan
it: Ignora
ja: 無視
ko: 무시
ms: Abaikan
nl: Negeren
pl: Ignoruj
pt_br: Ignorar
ru: Игнорировать
ta: அவகணிக்க
te: ప్రమాదం చేయండి
th: ละเว้น
tr: Yoksay
vi: Bỏ qua
zh_hans: 忽略

source: Internal error, this should not happen: %@
ar: خطأ داخلي، لا ينبغي أن يحدث هذا: %@
bn: অভ্যন্তরীণ ত্রুটি, এটি হওয়া উচিত নয়: %@
cs: Vnitřní chyba, toto by se nemělo stát: %@
de: Interner Fehler, das sollte nicht passieren: %@
es: Error interno, esto no debería ocurrir: %@
fr: Erreur interne, cela ne devrait pas arriver : %@
hi: आंतरिक त्रुटि, ऐसा नहीं होना चाहिए: %@
hu: Belső hiba, ennek nem szabadna megtörténnie: %@
id: Kesalahan internal, ini seharusnya tidak terjadi: %@
it: Errore interno, questo non dovrebbe accadere: %@
ja: 内部エラー、これは発生しないはずです: %@
ko: 내부 오류, 이 상황은 발생하지 않아야 합니다: %@
ms: Ralat dalaman, ini tidak sepatutnya berlaku: %@
nl: Interne fout, dit zou niet mogen gebeuren: %@
pl: Błąd wewnętrzny, to nie powinno się zdarzyć: %@
pt_br: Erro interno, isso não deveria acontecer: %@
ru: Внутренняя ошибка, этого не должно происходить: %@
ta: உள்ளக பிழை, இது நிகழக்கூடாது: %@
te: అంతర్గత లోపం, ఇది జరగకూడదు: %@
th: ข้อผิดพลาดภายใน, สิ่งนี้ไม่ควรเกิดขึ้น: %@
tr: Dahili hata, bu olmamalı: %@
vi: Lỗi nội bộ, điều này không nên xảy ra: %@
zh_hans: 内部错误，不应该发生：%@

source: Jump To
ar: انتقل إلى
bn: যাও
cs: Přejít na
de: Springe zu
es: Saltar a
fr: Aller à
hi: इस पर जाएं
hu: Ugrás ide
id: Lompat Ke
it: Vai a
ja: ジャンプ先
ko: 이동
ms: Lompat Ke
nl: Ga naar
pl: Przejdź do
pt_br: Ir Para
ru: Перейти к
ta: அடிக்கோடு செல்ல
te: దూకండి
th: ไปที่
tr: Git
vi: Chuyển đến
zh_hans: 跳转到

source: Line Number
ar: رقم السطر
bn: লাইন নম্বর
cs: Číslo řádku
de: Zeilennummer
es: Número de línea
fr: Numéro de ligne
hi: पंक्ति संख्या
hu: Sor száma
id: Nomor Baris
it: Numero di riga
ja: 行番号
ko: 줄 번호
ms: Nombor Baris
nl: Regelnummer
pl: Numer linii
pt_br: Número da Linha
ru: Номер строки
ta: வரி எண்
te: లైన్ నంబర్
th: หมายเลขบรรทัด
tr: Satır Numarası
vi: Số dòng
zh_hans: 行号

source: Open Shader
ar: فتح المظلل
bn: শেডার খুলুন
cs: Otevřít shader
de: Shader öffnen
es: Abrir shader
fr: Ouvrir le shader
hi: शेडर खोलें
hu: Shader megnyitása
id: Buka Shader
it: Apri shader
ja: シェーダーを開く
ko: 셰이더 열기
ms: Buka Shader
pl: Otwórz shader
pt_br: Abrir Shader
ru: Открыть шейдер
ta: ஷேடரைத் திறக்கவும்
te: షేడర్ తెరవండి
th: เปิดเชดเดอร์
tr: Gölgelendiriciyi Aç
vi: Mở Shader
zh_hans: 打开着色器

source: Pick
ar: اختار
bn: নির্বাচন করুন
cs: Vybrat
de: Auswählen
es: Seleccionar
fr: Choisir
hi: चुनें
hu: Kiválaszt
id: Pilih
it: Scegli
ja: 選択
ko: 선택
ms: Pilih
nl: Kiezen
pl: Wybierz
pt_br: Escolher
ru: Выбрать
ta: தேர்வு செய்
te: ఎంచుకోండి
th: เลือก
tr: Seç
vi: Chọn
zh_hans: 选择

source: Preview: %@
ar: معاينة: %@
bn: পূর্বরূপ: %@
cs: Náhled: %@
de: Vorschau: %@
es: Vista previa: %@
fr: Aperçu : %@
hi: पूर्वावलोकन: %@
hu: Előnézet: %@
id: Pratinjau: %@
it: Anteprima: %@
ja: プレビュー: %@
ko: 미리보기: %@
ms: Pratonton: %@
nl: Voorbeeld: %@
pl: Podgląd: %@
pt_br: Pré-visualização: %@
ru: Предварительный просмотр: %@
ta: முன்னோட்டம்: %@
te: మునుజూపు: %@
th: ตัวอย่าง: %@
tr: Önizleme: %@
vi: Xem trước: %@
zh_hans: 预览：%@

source: Retry
ar: إعادة المحاولة
bn: পুনরায় চেষ্টা করুন
cs: Zkusit znovu
de: Erneut versuchen
es: Reintentar
fr: Réessayer
hi: फिर कोशिश करें
hu: Újra
id: Coba Lagi
it: Riprova
ja: 再試行
ko: 다시 시도
ms: Cuba semula
nl: Probeer opnieuw
pl: Ponów Próbę
pt_br: Tentar Novamente
ru: Повторить
ta: மீண்டும் முயற்சிக்கவும்
te: మళ్ళీ ప్రయత్నించండి
th: ลองใหม่
tr: Tekrar Dene
vi: Thử lại
zh_hans: 重试

source: Save Shader
ar: حفظ الشادر
bn: শেডার সংরক্ষণ করুন
cs: Uložit shader
de: Shader speichern
es: Guardar shader
fr: Enregistrer le shader
hi: शेडर सहेजें
hu: Shader mentése
id: Simpan Shader
it: Salva shader
ja: シェーダーを保存
ko: 셰이더 저장
ms: Simpan Shader
nl: Shader Opslaan
pl: Zapisz shader
pt_br: Salvar Shader
ru: Сохранить шейдер
ta: ஷேடரை சேமிக்கவும்
te: షేడర్‌ను సేవ్ చేయండి
th: บันทึกเชดเดอร์
tr: Gölgelendiriciyi Kaydet
vi: Lưu Shader
zh_hans: 保存着色器

source: Save Shader As...
ar: احفظ الشادر باسم...
bn: শেডার হিসাবে সংরক্ষণ করুন...
cs: Uložit shader jako...
de: Shader speichern unter...
es: Guardar shader como...
fr: Enregistrer le shader sous...
hi: शेडर को ऐसे सहेजें...
hu: Shader mentése másként...
id: Simpan Shader Sebagai...
it: Salva Shader Come...
ja: シェーダーを別名で保存...
ko: 셰이더를 다른 이름으로 저장...
ms: Simpan Shader Sebagai...
nl: Shader opslaan als...
pl: Zapisz shader jako...
pt_br: Salvar Shader Como...
ru: Сохранить шейдер как...
ta: ஷேடரை சேமிக்கவும்...
te: షేడర్‌ను ఇలా సేవ్ చేయండి...
th: บันทึกเชดเดอร์เป็น...
tr: Gölgelendiriciyi Farklı Kaydet...
vi: Lưu Shader Dưới dạng...
zh_hans: 保存着色器为...

source: Select a Font
ar: اختر خطًا
bn: একটি ফন্ট নির্বাচন করুন
cs: Vyberte písmo
de: Schriftart auswählen
es: Seleccionar una fuente
fr: Sélectionner une police
hi: फ़ॉन्ट चुनें
hu: Válasszon egy betűtípust
id: Pilih Font
it: Seleziona un font
ja: フォントを選択
ko: 폰트 선택
ms: Pilih Fon
nl: Selecteer een lettertype
pl: Wybierz czcionkę
pt_br: Selecionar uma Fonte
ru: Выберите шрифт
ta: ஒரு எழுத்துருவை தேர்ந்தெடுக்கவும்
te: ఫాంట్‌ను ఎంచుకోండి
th: เลือกแบบอักษร
tr: Bir Yazı Tipi Seç
vi: Chọn một phông chữ
zh_hans: 选择字体

source: Shader Editor
ar: محرر الطيف
bn: শেডার এডিটর
cs: Editor shaderů
es: Editor de Shader
fr: Éditeur de shader
hi: शेडर संपादक
hu: Shader szerkesztő
id: Editor Shader
it: Editor di shader
ja: シェーダーエディター
ko: 셰이더 에디터
ms: Editor Shader
pl: Edytor shaderów
pt_br: Editor de Shader
ru: Редактор шейдеров
ta: ஷேடர் எடிட்டர்
te: షేడర్ ఎడిటర్
th: ตัวแก้ไขเชเดอร์
tr: Shader Düzenleyici
vi: Trình chỉnh sửa Shader
zh_hans: 着色器编辑器

source: The quick brown fox jumps over the lazy dog
ar: الثعلب البني السريع يقفز فوق الكلب الكسول
bn: দ্রুত বাদামী শিয়ালটি অলস কুকুরের উপর দিয়ে লাফ দেয়
cs: Rychlá hnědá liška přeskočí líného psa
de: Der schnelle braune Fuchs springt über den faulen Hund
es: El rápido zorro marrón salta sobre el perro perezoso
fr: Le rapide renard brun saute par-dessus le chien paresseux
hi: तेज़ भूरी लोमड़ी सुस्त कुत्ते के ऊपर कूदती है
hu: A gyors barna róka átugrik a lusta kutya fölött
id: Rubah coklat cepat melompati anjing malas
it: La rapida volpe marrone salta sopra il cane pigro
ja: 素早い茶色の狐が怠け者の犬を飛び越える
ko: 빠른 갈색 여우가 게으른 개를 뛰어넘습니다
ms: Musang coklat pantas melompat melepasi anjing malas
nl: De snelle bruine vos springt over de luie hond
pl: Szybki brązowy lis przeskakuje nad leniwym psem
pt_br: O rápido cachorro marrom pula sobre o cão preguiçoso
ru: Быстрая коричневая лиса перепрыгивает через ленивую собаку
ta: வேகமான பழுப்பு நரி சோம்பேறி நாயின் மீது குதிக்கிறது
te: తేలికగా ఉన్న కుక్కపై వేగంగా ఉన్న గోధుమ నక్క దూకింది
th: สุนัขจิ้งจอกสีน้ำตาลกระโดดข้ามสุนัขขี้เกียจ
tr: Hızlı kahverengi tilki tembel köpeğin üzerinden atlar
vi: Con cáo nâu nhanh nhẹn nhảy qua con chó lười biếng
zh_hans: 敏捷的棕色狐狸跳过懒狗
